## 1. Write a lambda function to rearrange positive and negative numbers in agiven list

Sample output:

original_list = [-1,2,-3,4,-5,6,-7,8,-9,10,-11,12]

resulting_list = [2,4,6,8,10,12,-11,-9,-7,-5,-3,-1]

In [1]:
#or_list= [-1,2,-3,4,-5,6,-7,8,-9,10,-11,12]

#rearrange_numbers = lambda or_list: [x for x in or_list if x >= 0] + [x for x in or_list if x < 0]
#resulting_list=rearrange_numbers(or_list)
#print(resulting_list)

In [2]:
original_list = [-1,2,-3,4,-5,6,-7,8,-9,10,-11,12]

resulting_list=list(filter(lambda x: x>0, original_list)) + sorted(list(filter(lambda x: x<0, original_list)))

print(resulting_list)

[2, 4, 6, 8, 10, 12, -11, -9, -7, -5, -3, -1]

## 2. Create a new dataframe using week_11/temperatures/temperature.csv file

In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

temp_df=pd.read_csv('temperature.csv')
temp_df.head()

,datetime,Vancouver,Portland,San Francisco,Seattle,Los Angeles,San Diego,Las Vegas,Phoenix,Albuquerque,...,Philadelphia,New York,Montreal,Boston,Beersheba,Tel Aviv District,Eilat,Haifa,Nahariyya,Jerusalem
0,10/1/2012 12:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,309.100000,NaN,NaN,NaN
1,10/1/2012 13:00,284.630000,282.080000,289.480000,281.800000,291.870000,291.530000,293.410000,296.600000,285.120000,...,285.630000,288.220000,285.830000,287.170000,307.590000,305.470000,310.580000,304.4,304.4,303.5
2,10/1/2012 14:00,284.629041,282.083252,289.474993,281.797217,291.868185,291.533501,293.403141,296.608509,285.154558,...,285.663208,288.247676,285.834650,287.186092,307.590000,304.310000,310.495769,304.4,304.4,303.5
3,10/1/2012 15:00,284.626998,282.091866,289.460618,281.789833,291.862844,291.543355,293.392177,296.631487,285.233952,...,285.756824,288.326940,285.847789,287.231672,307.391513,304.281841,310.411539,304.4,304.4,303.5
4,10/1/2012 16:00,284.624955,282.100481,289.446243,281.782449,291.857503,291.553209,293.381213,296.654466,285.313345,...,285.850440,288.406203,285.860929,287.277251,307.145200,304.238015,310.327308,304.4,304.4,303.5

It should have the datetime column and one of the cities.

In [4]:
temp_df["datetime"]=pd.to_datetime(temp_df["datetime"]) #parse date
temp_df2=temp_df.filter(["datetime", 'Montreal'], axis=1)#isolate city and datetime col
temp_df2.dropna(inplace=True) #drop NAN

Create a new boolean column called is_freezing that indicates if the temperature is at or below freezing.

In [5]:
temp_df2['is_freezing']=temp_df2['is_freezing']=temp_df2.apply(lambda x: x['Montreal']<=273.15,axis=1) #map freezing temp condition to Montreal col

In [6]:
temp_df2.tail() #print end

                 datetime  Montreal  is_freezing
45248 2017-11-29 20:00:00    275.13        False
45249 2017-11-29 21:00:00    274.13        False
45250 2017-11-29 22:00:00    273.48        False
45251 2017-11-29 23:00:00    272.48         True
45252 2017-11-30 00:00:00    271.80         True

In [7]:
temp_df2['is_freezing'].value_counts() #num of dates temp was freezing (True)

False    32284
True     12966
Name: is_freezing, dtype: int64

In [14]:
import time
tic=time.perf_counter() #basic timer start 
temp_df2['is_freezing']=temp_df2.apply(lambda x: x['Montreal']<=273.15,axis=1)
toc=time.perf_counter()#timer stop
print(f" lambda functon ran in {toc-tic:0.4f} seconds") #calc start-stop for runtime format 4 decimal places

 lambda functon ran in 1.4189 seconds

In [12]:
temp_df3=temp_df2.copy()#copy df 
boolean_col = (temp_df3['Montreal']<=273.15)#expression for new col with temp condition 
temp_df3['is_freezing'] = boolean_col #create new col
temp_df3.tail()

                 datetime  Montreal  is_freezing
45248 2017-11-29 20:00:00    275.13        False
45249 2017-11-29 21:00:00    274.13        False
45250 2017-11-29 22:00:00    273.48        False
45251 2017-11-29 23:00:00    272.48         True
45252 2017-11-30 00:00:00    271.80         True

In [10]:
temp_df3['is_freezing'].value_counts() #verify data is correct and matches lambda results

False    32284
True     12966
Name: is_freezing, dtype: int64

Is there a better way to do this than with a lambda?

The second function runs quicker than the lambda function

In [11]:
#time new function 
tic=time.perf_counter()
temp_df3['is_freezing'] = (temp_df3['Montreal']<=273.15)
toc=time.perf_counter()
print(f" bool expression ran in {toc-tic:0.4f} seconds")

 bool expression ran in 0.0024 seconds

## BONUS: if you still have time, try to do a pivot of the data in question 2 so you have the hourly data for all the cities and a flag for if it's freezing.